<?php

use App\Ccu\General\Category;
use Illuminate\Database\Seeder;

class CategoryTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $static = [
            'semester' => [
                '99以前', '100上', '100下', '101上', '101下',
                '102上', '102下', '103上', '103下', '104上', '104下',
            ],

            'college' => [
                '文學院', '理學院', '社會科學學院', '工學院', '管理學院', '法學院', '教育學院', '其他',
            ],

            'department' => [
                '通識中心' => 'I001', '軍訓' => 'V000', '體育中心' => 'F000', '語言中心' => 'Z121',

                '中文系' => 1104, '外文系' => 1154, '歷史系' => 1204, '哲學系' => 1254,
                '數學系' => 2104, '物理系' => 2204, '地環系' => 2354, '生科系' => 2504, '化暨生化系' => 2604,
                '社福系' => 3104, '心理系' => 3154, '勞工系' => 3204, '政治系' => 3304, '傳播系' => 3354,
                '資工系' => 4104, '電機系' => 4154, '機械系' => 4204, '化工系' => 4254, '通訊系' => 4304,
                '經濟學系' => 5104, '財金系' => 5154, '企管系' => 5204, '會資系' => 5264, '資管系' => 5304,
                '法律系' => 6054, '法學組' => 6104, '法制組' => 6204, '財法系' => 6304,
                '成教系' => 7104, '犯防系' => 7254, '運競系' => 7364,

                '中文所' => 1106, '外文所' => 1156, '歷史所' => 1206, '哲學所' => 1256, '語言所' => 1306, '英語教學所' => 1366, '台文所' => 1406,
                '應數所' => 2106, '地震所' => 2156, '物理所' => 2206, '統科所' => 2316, '地環所' => 2386, '數學所' => 2406, '分子生物所' => 2456, '生醫所' => 2556, '化暨生化所' => 2606,
                '社福所' => 3106, '心理所' => 3156, '勞工所' => 3206, '政治所' => 3306, '電傳所' => 3356, '戰略所' => 3416, '臨床心理所' => 3656,
                '資工所' => 4106, '電機所' => 4156, '機械所' => 4206, '化工所' => 4256, '通訊所' => 4306, '光機電所' => 4416,
                '國經所' => 5106, '財金所' => 5156, '企管所' => 5206, '會資所' => 5266, '資管所' => 5306, '行銷管理所' => 5456, '醫療資訊管理所' => 5556,
                '法律所' => 6056, '財法所' => 6306,
                '成教所' => 7106, '教育所' => 7156, '犯防所' => 7256, '休閒教育所' => 7356, '課研所' => 7406, '高齡教育所' => 7506,

                '文學院學士班' => 1014, '文學院碩士班' => 1016,
                '理學院學士班' => 2014, '理學院碩士班' => 2016,
                '社會科學院學士班' => 3014, '社會科學院碩士班' => 3016, '認知科學博士學位學程' => 1041,
                '工學院學士班' => 4014, '工學院碩士班' => 4016, '前瞻製造系統碩士學位學程' => 4456,
                '管理學院學士班' => 5014, '管理學院碩士班' => 5016, '國際財管碩士學位學程' => 5356,
                '法學院學士班' => 6014, '法學院碩士班' => 6016,
                '教育學院學士班' => 7014, '教育學院碩士班' => 7016, '師培中心' => 7306, '教育領導碩士學位學程' => 7456,
            ],

            'course.dimension' => [
                '中國語文知識與應用', '人文思維與生命探索', '公民與社會參與', '基礎概論課程',
                '經濟與國際脈動', '能源、環境與生態', '自然科學與技術', '英文能力訓練', '藝術與美學',
                '資訊能力課程', '跨向度課程「中正講座」',
            ],

            'professor' => [
                '丁川康', '丁初稷', '丁碧玉', '丁誌魰', '于淑君', '尤玲凰', '方志強', '方慧臻', '方瓊瑤',
                '毛文芳', '毛漢光', '王一奇', '王丹', '王仁俊', '王元章', '王少君', '王心如', '王文杰',
                '王文郁', '王正', '王正嘉', '王民良', '王立仁', '王安祥', '王宏魯', '王志誠', '王秀華',
                '王秀鳳', '王昇徽', '王明月', '王明昌', '王俊堯', '王建宏', '王秋玲', '王釗洪', '王國羽',
                '王崇人', '王祥辰', '王逢盛', '王朝弘', '王欽戊', '王舒芸', '王進賢', '王雅玄', '王順正',
                '王嵩音', '王瑜琳', '王瑞任', '王嘉興', '王維旎', '王維豪', '王德睦', '王樂民', '王豐彬',
                '王瓊玲', '王韻茹', '王櫻芬', '包健華', '古月萍', '史玉山', '甘宏志', '甘德星', '石瑞銓',
                '任秀林', '任春平', '吉凱明', '曲宏宇', '朱元三', '朱延和', '朱威達', '朱柔若', '朱振宏',
                '朱啟華', '朱琇妍', '朱群芳', '江永清', '江佩如', '江明格', '江俊龍', '江姿穎', '江為國',
                '江振國', '江瑞秋', '江義雄', '江嘉琪', '江謝宏任', '江寶釵', '艾昌瑞', '何加政', '何信翰',
                '何宣甫', '何建德', '何德華', '何澤華', '余文卿', '余文章', '余松年', '余英豪', '余國瑞',
                '余祥義', '余曉靜', '吳元康', '吳永倩', '吳亦昕', '吳帆', '吳君毅', '吳秀瑾', '吳邦一',
                '吳承崧', '吳昇', '吳明烈', '吳明儒', '吳欣澤', '吳育仁', '吳俊雄', '吳信華', '吳建華',
                '吳政龍', '吳柏龍', '吳致寧', '吳英隆', '吳貞慧', '吳容輝', '吳徐哲', '吳珮慈', '吳彬安',
                '吳啟新', '吳淑芬', '吳榮宗', '吳慶隆', '吳燕妮', '吳錦文', '呂明純', '呂明諺', '呂明錡',
                '呂建德', '呂昱瑋', '呂學諭', '宋倩如', '宋學文', '李仁淼', '李元宏', '李元希', '李元堯',
                '李文乾', '李文新', '李玉琇', '李妙純', '李沁', '李秀雲', '李佩昕', '李佩芳', '李佩珊',
                '李佩璇', '李佳玲', '李佳家', '李佳綺', '李奉儒', '李孟玢', '李孟修', '李季湜', '李宗憲',
                '李宗霖', '李承龍', '李昌明', '李俊宏', '李俊毅', '李政忠', '李政怡', '李映瑾', '李昭毅',
                '李洸楚', '李皇辰', '李若文', '李振卿', '李栢浡', '李珮如', '李偉銘', '李國揚', '李淑芳',
                '李淑卿', '李進榮', '李雅慧', '李新林', '李詩偉', '李翠萍', '李興生', '李錫隆', '李優俐',
                '李藹慈', '杜子信', '杜明憲', '汪詩珮', '沈文和', '沈玉玲', '沈仲維', '沈伯凡', '沈緯鈞',
                '阮金聲', '卓佳慶', '卓建宏', '卓瑩鎗', '周力德', '周正中', '周兆昱', '周玟琪', '周育賢',
                '周育叡', '周振鋒', '周登陽', '周德璋', '周禮君', '官有垣', '林子綾', '林文昌', '林文莉',
                '林平', '林永豐', '林玉瓊', '林向愷', '林妙香', '林辰穎', '林孟玲', '林岳亨', '林岳喬',
                '林怡玫', '林怡婷', '林承賢', '林明地', '林明炤', '林明傑', '林欣瑩', '林玟廷', '林育群',
                '林俊元', '林俊臣', '林冠妤', '林政逸', '林昭任', '林柏宏', '林柏青', '林洲富', '林派臣',
                '林盈慧', '林茂安', '林晉榮', '林泰吉', '林泰和', '林財鈺', '林迺衛', '林敏雄', '林望民',
                '林淑芳', '林淑慧', '林惠勇', '林惠玲', '林渝詠', '林湘', '林瑞欽', '林榮信', '林維暘',
                '林德瑞', '林慧旻', '林憲平', '林燊祿', '林麗惠', '林麗菊', '花良釗', '邱子修', '邱仲仁',
                '邱茂清', '邱獻輝', '邱耀志', '金凱文', '門福國', '侯廷昭', '侯育銘', '侯維之', '姚宏宗',
                '姚松偉', '姚信安', '姚淑芬', '姜定宇', '施宇澤', '施慧玲', '柯仁松', '柯耀程', '柳金章',
                '洪千雅', '洪旭慶', '洪伯誠', '洪志成', '洪育忠', '洪為璽', '洪清德', '洪博雄', '洪新原',
                '洪嘉璟', '洪德生', '洪賢信', '紀美秀', '紀惠瓊', '紀鳳鳴', '胡元輝', '胡家彰', '胡雅涵',
                '胡夢鯨', '胡維平', '范誠偉', '唐士哲', '唐孟祺', '孫佳宏', '孫隆基', '徐于捷', '徐千偉',
                '徐晏萱', '徐淑裕', '浦忠勇', '祖旭華', '翁世芳', '翁旭惠', '翁嘉英', '耿慧玲', '郝鳳鳴',
                '馬玉紅', '馬財專', '馬躍中', '高文彬', '高文琦', '高正雄', '高永洲', '高泉豐', '崔曉倩',
                '張仁瑞', '張文成', '張文恭', '張世昕', '張世雄', '張永孚', '張玉鈴', '張守德', '張秀蓉',
                '張忠宏', '張怡秋', '張建俅', '張美芳', '張書豪', '張國恩', '張淵智', '張清豐', '張盛富',
                '張博文', '張菀珍', '張詒政', '張量懿', '張閔翔', '張道周', '張嘉芳', '張嘉展', '張寧',
                '張慈芬', '張榮貴', '張榮興', '張漢呈', '張碩毅', '張德卿', '張瓊霙', '敖仲寧', '曹嘉玲',
                '梁弘孟', '梁鈞筌', '梁贊全', '盛子龍', '莊世杰', '莊家瑋', '莊益源', '莊詠婷', '許千昱',
                '許文蔚', '許功餘', '許正平', '許宏銘', '許志成', '許佳振', '許岱欣', '許昺慕', '許秋田',
                '許華孚', '許毓珊', '許嘉文', '許漢', '許劍橋', '許繼峰', '許巍嚴', '連啟舜', '連雅慧',
                '郭秀鈴', '郭良瑋', '郭亮廷', '郭勇志', '郭政隆', '郭春寶', '郭祐輑', '郭靜云', '陳仁義',
                '陳孔麒', '陳文吟', '陳月妙', '陳世彬', '陳世樂', '陳世憲', '陳世曄', '陳加屏', '陳巧雲',
                '陳永松', '陳永洲', '陳永恩', '陳玉美', '陳玉樹', '陳立文', '陳立軒', '陳光輝', '陳安行',
                '陳自強', '陳伯璋', '陳伯謙', '陳孝平', '陳志昕', '陳佳銘', '陳和全', '陳奇鈺', '陳孟熙',
                '陳尚志', '陳幸仁', '陳怡君', '陳怡華', '陳怡群', '陳怡甄', '陳昇鴻', '陳明祥', '陳明德',
                '陳欣進', '陳欣徽', '陳玟君', '陳芳岳', '陳芳珮', '陳金哲', '陳俊民', '陳俊啟', '陳勁初',
                '陳姚真', '陳建忠', '陳建易', '陳昭榮', '陳昱仁', '陳昱任', '陳柯玫', '陳為政', '陳界宏',
                '陳家榮', '陳恭', '陳浩仁', '陳國榮', '陳淑英', '陳淑容', '陳雪珠', '陳喬恩', '陳景章',
                '陳朝輝', '陳皓君', '陳詠卉', '陳進祥', '陳逸名', '陳逸根', '陳隆暉', '陳毓璟', '陳瑞麟',
                '陳誠仁', '陳慈幸', '陳慈芬', '陳慧女', '陳靜誼', '陳鏡堯', '陳韻', '陳鵬升', '陸維元',
                '魚地加代子', '麥傑', '傅俊中', '彭國能', '彭輝郎', '曾玉村', '曾光華', '曾沈連魁', '曾怡蓉',
                '曾品傑', '曾建興', '曾炳墝', '曾淑萍', '曾惠真', '曾銘仁', '曾孆瑾', '游文嘉', '游景晴',
                '游朝堂', '游蓓怡', '游寶達', '湯敬文', '程中玉', '程嘉彥', '華繼中', '萇瑞松', '辜仲明',
                '馮立功', '馮展華', '馮國華', '黃士軒', '黃士銘', '黃子偉', '黃仁竑', '黃介良', '黃世琤',
                '黃以文', '黃冬梨', '黃正魁', '黃光國', '黃光策', '黃劭彥', '黃志奇', '黃良志', '黃佳盛',
                '黃承德', '黃明進', '黃俊杰', '黃俊儒', '黃俊龍', '黃柏農', '黃柏禎', '黃珍鈺', '黃英傑',
                '黃英龍', '黃郁芬', '黃崇勛', '黃啟富', '黃敏郎', '黃清順', '黃富琴', '黃富順', '黃惠華',
                '黃敬群', '黃聖言', '黃維民', '黃維賢', '黃德舜', '黃憲斌', '黃興進', '黃蕙珠', '黃錦山',
                '黃錦珠', '黃靜吟', '黃耀廷', '黃馨瑩', '楊士隆', '楊子萱', '楊仁宗', '楊文芬', '楊玉君',
                '楊宇勛', '楊宏暉', '楊志和', '楊佳霖', '楊岳龍', '楊亮梅', '楊美娟', '楊深坑', '楊通軒',
                '楊智媖', '楊智景', '楊雅博', '楊意鈴', '楊維真', '溫士忠', '溫怡瑛', '葉丁鴻', '葉世彬',
                '葉玉蓮', '葉秀珍', '葉長城', '葉純純', '葉耕榕', '葉國俊', '葉經緯', '葉錦鴻', '詹盛如',
                '雷家驥', '廖文欽', '廖幼華', '廖坤榮', '廖宗文', '廖宗聖', '廖俊儒', '廖則竣', '廖浿晴',
                '廖健男', '廖敏如', '廖福村', '廖儒修', '廖學志', '廖憶榕', '廖蕙玟', '熊博安', '管中祥',
                '褚孫錦', '趙文志', '趙鴻椿', '劉文献', '劉台生', '劉立頌', '劉吉宴', '劉如蓉', '劉亞秋',
                '劉宗憲', '劉俊麟', '劉建宏', '劉建聖', '劉政益', '劉祐任', '劉偉名', '劉從葦', '劉淑燕',
                '劉清標', '劉黃麗娟', '劉維正', '劉德烜', '劉德騏', '劉興民', '劉鋼', '劉駿州', '樊貴文',
                '樓文達', '歐國斌', '歐進士', '歐陽敏', '潘仁義', '潘志祥', '潘李賢', '潘瑋', '蔡中暉',
                '蔡允棟', '蔡仰虔', '蔡行健', '蔡作敏', '蔡志忠', '蔡志強', '蔡秀美', '蔡佩蓉', '蔡孟勳',
                '蔡宗亨', '蔡忠道', '蔡明宏', '蔡明倫', '蔡炎熾', '蔡育岱', '蔡政宇', '蔡玲玲', '蔡美玉',
                '蔡素娟', '蔡崇隆', '蔡清田', '蔡登龍', '蔡皓丞', '蔡翔任', '蔡華凱', '蔡敬誠', '蔡榮祥',
                '蔡榮婷', '蔣文祁', '蔣見超', '鄧閔鴻', '鄭友仁', '鄭文輝', '鄭安利', '鄭伯炤', '鄭志鈞',
                '鄭幸雅', '鄭津津', '鄭國順', '鄭清霞', '鄭祥麟', '鄭凱謙', '鄭勝耀', '鄭博仁', '鄭揚耀',
                '鄭逸如', '鄭瑞隆', '鄭榮偉', '鄭讚源', '盧映潔', '盧龍泉', '盧鴻毅', '蕭文生', '蕭世朗',
                '蕭光明', '蕭庭郎', '蕭淑惠', '蕭義玲', '賴文能', '賴玉玲', '賴宏彬', '賴振耀', '賴靖宜',
                '賴槿峰', '賴錫三', '遲銘璋', '戴伸峰', '戴明德', '戴建國', '戴浩一', '戴皖文', '薛幼苓',
                '薛立言', '謝三榮', '謝文馨', '謝世民', '謝立宜', '謝佩君', '謝孟龍', '謝明勳', '謝玲玉',
                '謝哲勝', '謝國欣', '謝創智', '謝進見', '謝雅萍', '謝瑞隆', '謝馥年', '謝議霆', '鍾文鼎',
                '鍾宇軒', '鍾欣志', '鍾媄媜', '鍾菁哲', '鍾憲瑞', '韓殿君', '簡妙如', '簡建忠', '簡美華',
                '簡麗環', '藍玉春', '藍科正', '鎮明常', '顏子瑜', '顏伯蒼', '顏君彰', '顏宏住', '顏尚文',
                '魏台輝', '魏伶娟', '魏國佐', '魏惠娟', '魏楚陽', '羅文玲', '羅世宏', '羅林', '羅俊瑋',
                '羅美玲', '羅家倫', '羅習五', '嚴嘉明', '蘇全正', '蘇宏仁', '蘇旺昌', '蘇金錢山', '蘇雅蕙',
                '顧玉山', '顧曉雲', '襲充文', '龔紹明', '龔詩堯',
            ],
        ];

        foreach ($static as $category => $items) {
            foreach ($items as $key => $value) {
                $instance = Category::firstOrCreate([
                    'category' => $category,
                    'name' => is_int($key) ? $value : $key,
                ]);

                if (! is_int($key)) {
                    $instance->update(['remark' => $value]);
                }
            }
        }

        $this->classifyDepartment();

        Cache::forget('categoriesTable');
    }

    /**
     * 將系所分到學院中.
     *
     * @return void
     */
    protected function classifyDepartment()
    {
        $colleges = ['文學院', '理學院', '社會科學學院', '工學院', '管理學院', '法學院', '教育學院', '其他'];

        foreach (Category::where('category', 'college')->get() as $college) {
            $index = array_search($college->getAttribute('name'), $colleges, true) + 1;

            $query = Category::where('category', 'department');

            if (8 !== $index) {
                $query = $query->where('remark', 'like', "{$index}%");
            } else {
                $query = $query->whereIn('remark', ['I001', 'V000', 'F000', 'Z121']);
            }

            $college->update(['remark' => $query->orderBy('id')->get()->implode('id', ',')]);
        }
    }
}
