<?php

use App\Ccu\General\Category;
use Illuminate\Database\Seeder;

class CategoryTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $static = [
            'semester' => [
                '99以前', '100上', '100下', '101上', '101下',
                '102上', '102下', '103上', '103下', '104上', '104下',
            ],

            'college' => [
                '文學院', '理學院', '社會科學學院', '工學院', '管理學院', '法學院', '教育學院', '其他',
            ],

            'department' => [
                '通識中心' => 'I001', '軍訓' => 'V000', '體育中心' => 'F000', '語言中心' => 'Z121',

                '中文系' => 1104, '外文系' => 1154, '歷史系' => 1204, '哲學系' => 1254,
                '數學系' => 2104, '物理系' => 2204, '地環系' => 2354, '生科系' => 2504, '化暨生化系' => 2604,
                '社福系' => 3104, '心理系' => 3154, '勞工系' => 3204, '政治系' => 3304, '傳播系' => 3354,
                '資工系' => 4104, '電機系' => 4154, '機械系' => 4204, '化工系' => 4254, '通訊系' => 4304,
                '經濟學系' => 5104, '財金系' => 5154, '企管系' => 5204, '會資系' => 5264, '資管系' => 5304,
                '法律系' => 6054, '法學組' => 6104, '法制組' => 6204, '財法系' => 6304,
                '成教系' => 7104, '犯防系' => 7254, '運競系' => 7364,

                '中文所' => 1106, '外文所' => 1156, '歷史所' => 1206, '哲學所' => 1256, '語言所' => 1306, '英語教學所' => 1366, '台文所' => 1406,
                '應數所' => 2106, '地震所' => 2156, '物理所' => 2206, '統科所' => 2316, '地環所' => 2386, '數學所' => 2406, '分子生物所' => 2456, '生醫所' => 2556, '化暨生化所' => 2606,
                '社福所' => 3106, '心理所' => 3156, '勞工所' => 3206, '政治所' => 3306, '電傳所' => 3356, '戰略所' => 3416, '臨床心理所' => 3656,
                '資工所' => 4106, '電機所' => 4156, '機械所' => 4206, '化工所' => 4256, '通訊所' => 4306, '光機電所' => 4416,
                '國經所' => 5106, '財金所' => 5156, '企管所' => 5206, '會資所' => 5266, '資管所' => 5306, '行銷管理所' => 5456, '醫療資訊管理所' => 5556,
                '法律所' => 6056, '財法所' => 6306,
                '成教所' => 7106, '教育所' => 7156, '犯防所' => 7256, '休閒教育所' => 7356, '課研所' => 7406, '高齡教育所' => 7506,

                '文學院學士班' => 1014, '文學院碩士班' => 1016,
                '理學院學士班' => 2014, '理學院碩士班' => 2016,
                '社會科學院學士班' => 3014, '社會科學院碩士班' => 3016, '認知科學博士學位學程' => 3706,
                '工學院學士班' => 4014, '工學院碩士班' => 4016, '前瞻製造系統碩士學位學程' => 4456,
                '管理學院學士班' => 5014, '管理學院碩士班' => 5016, '國際財管碩士學位學程' => 5356,
                '法學院學士班' => 6014, '法學院碩士班' => 6016,
                '教育學院學士班' => 7014, '教育學院碩士班' => 7016, '師培中心' => 7306, '教育領導碩士學位學程' => 7456,
            ],

            'course.dimension' => [
                '中國語文知識與應用', '人文思維與生命探索', '公民與社會參與', '基礎概論課程',
                '經濟與國際脈動', '能源、環境與生態', '自然科學與技術', '英文能力訓練', '藝術與美學',
                '資訊能力課程', '跨向度課程「中正講座」',
            ],
        ];

        foreach ($static as $category => $items) {
            foreach ($items as $key => $value) {
                $instance = Category::firstOrCreate([
                    'category' => $category,
                    'name' => is_int($key) ? $value : $key,
                ]);

                if (! is_int($key)) {
                    $instance->update(['remark' => $value]);
                }
            }
        }

        $this->classifyDepartment();

        Cache::forget('categoriesTable');
    }

    /**
     * 將系所分到學院中.
     *
     * @return void
     */
    protected function classifyDepartment()
    {
        $colleges = ['文學院', '理學院', '社會科學學院', '工學院', '管理學院', '法學院', '教育學院', '其他'];

        foreach (Category::where('category', 'college')->get() as $college) {
            $index = array_search($college->getAttribute('name'), $colleges, true) + 1;

            $query = Category::where('category', 'department');

            if (8 !== $index) {
                $query = $query->where('remark', 'like', "{$index}%");
            } else {
                $query = $query->whereIn('remark', ['I001', 'V000', 'F000', 'Z121']);
            }

            $college->update(['remark' => $query->orderBy('id')->get()->implode('id', ',')]);
        }
    }
}
